

#ifndef ICMP_HEADER_H
#define ICMP_HEADER_H

#include<stdint.h>

/*


 
                                ICMP协议请求 / 回答报文格式 
                            0        8       16                32 
                            +--------+--------+-----------------+ 
                            |  类型   |  代码  |      校验和      | 
                            +--------+--------+-----------------+ 
                            |      标识符      |       序号       | 
                            +-----------------+-----------------+ 
                            |             可选数据               | 
                            +-----------------+-----------------+ 

               ICMP 请求报文                             ICMP 应答报文 
    +--------+--------+---------------+        +--------+--------+---------------+ 
    |  类型  |  代码   |       描述     |        |  类型  |  代码  |      描述      | 
    +--------+--------+---------------+        +--------+--------+---------------+ 
    |    8   |    0   |     回显请求   |        |    0   |    0   |     回显回答   | 
    +--------+--------+---------------+        +--------+--------+---------------+ 
    |   10   |    0   |    路由器请求  |        |    9   |    0   |     路由器回答  | 
    +--------+--------+---------------+        +--------+--------+---------------+ 
    |   13   |    0   |    时间戳请求  |        |   14   |    0   |     时间戳回答  | 
    +--------+--------+---------------+        +--------+--------+---------------+ 
    |   15   |    0   |  信息请求(废弃) |        |   16   |    0   |  信息回答(废弃)| 
    +--------+--------+---------------+        +--------+--------+---------------+ 
    |   17   |    0   |   地址掩码请求  |        |   18   |    0   |  地址掩码回答  | 
    +--------+--------+---------------+        +--------+--------+---------------+ 

type:
        类型代码 ： 类型描述

          0 ：   响应应答（ECHO-REPLY）
          3 ：  不可到达
          4 ：  源抑制
          5 ：  重定向
          8  ：  响应请求（ECHO-REQUEST）
          11  ：  超时
          12  ： 参数失灵
          13 ：   时间戳请求
          14 ：  时间戳应答
          17  ：  地址掩码请求
          18  ：  地址掩码应答
          30  ： 路由跟踪

常用type和code的搭配
        类型0、代码0：回应应答。
        类型3、代码0：网络不可达
        类型3、代码1：主机不可达
        类型5、代码1：为主机重定向数据包
        类型8、代码0：回应
        类型11、代码0：传输中超出TTL（超时）

*/

struct CICMPHeader{

    uint8_t type;
    uint8_t code;
    uint16_t checkSum;
    uint16_t ID;
    uint16_t seq;
    uint32_t timeStamp;  // 时间戳（非标准ICMP头部, 不一定都会响应）

};

#endif